

// to make the code clean

function createCheckbox(parent_id, arr){
	for (var i = 0; i < arr.length; i++) {
		var chk = document.createElement("input");
		chk.setAttribute("type", "checkbox");
		chk.value = arr[i];
		document.getElementById(parent_id).appendChild(chk)
		var text = document.createTextNode(arr[i])
		document.getElementById(parent_id).appendChild(text);
	}
	
}

function createSelect(parent_id, arr){
	var parent = document.getElementById(parent_id);
	for (var i = 0; i < arr.length; i++) {
		var opt = document.createElement("option");
		opt.textContent = opt.value = arr[i];
		parent.appendChild(opt);
	}

}

window.onload = function(){
	var s1 = ["―请选择―","青岛市南","青岛市北","青岛四方","青岛李沧","青岛崂山","青岛城阳","青岛黄岛","青岛即墨","青岛胶州","青岛胶南","青岛平度","青岛莱西","--------","山东","北京","天津","上海","重庆","安徽","江苏","浙江","福建","甘肃","广东","广西","贵州","海南","河北","河南","黑龙江","湖北","湖南","吉林","江西","辽宁","内蒙","宁厦","青海","山西","陕西","四川","西藏","香港","新疆","云南"]
	createSelect('s1', s1)
//	var s2 = ["选择 年","1945","1946","1947","1948","1949","1950","1951","1952","1953","1954","1955","1956","1957","1958","1959","1960","1961","1962","1963","1964","1965","1966","1967","1968","1969","1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980","1981","1982","1983","1984","1985","1986","1987","1988","1989","1990","1991","1992","1993","1994","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014"]
//	createSelect('s2', s2)
	
	var c1 = ["小学语文","小学数学","小学英语","小学奥数","小学全科"];
	createCheckbox("c1", c1);
	var c2 = ["初中语文","初中英语","初中数学","初中物理","初中化学","初中地理","初中生物","初中数理化","初中全科","初中奥数","中考语文","中考英语","中考数学","中考物理","中考化学","中考数理化","中考全科","中考心理辅导"];
	createCheckbox("c2", c2);
	var c3 = ["高一高二语文","高一高二英语","高一高二数学","高一高二物理","高一高二化学","高一高二地理","高一高二生物","高考语文","高考英语","高考数学","高考物理","高考化学","高考数理化","高考美术","高考理综","高考文综","高考心理辅导"];
	createCheckbox("c3", c3);
	var c4 = ["高等数学","考研数学"];
	createCheckbox("c4", c4);
	var c5 = ["英语口语","新概念英语","牛津英语","英语四级","英语六级","GRE","托福","雅思","初级商务英语","高级商务英语","剑桥英语"];
	createCheckbox("c5", c5);
	var c6 = ["日语","法语","德语","韩语","俄语","西班牙语","葡萄牙语","阿拉伯语"];
	createCheckbox("c6", c6);
	var c7 = ["摄影","书法","美术","漫画","中国画","西洋画","交谊舞","芭蕾舞","声乐（美声）","声乐（民族）"];
	createCheckbox("c7", c7);
	var c8 = ["钢琴","电子琴","小提琴","大提琴","长笛","吉它","手风琴","萨克斯","打击乐","小号","大号","圆号","二胡","笛子","琵琶","古筝","古琴"];
	createCheckbox("c8", c8);
	var c9 = ["计算机基本操作","数据库","网页设计与制作","计算机应用能力","Linux或Unix","网站开发","图像处理软件","动画制作","程序设计","程序设计高级","微软证书"];
	createCheckbox("c9", c9);
	var c10 = ["围棋","中国象棋","国际象棋","中国武术散打","拳击","截拳道","跆拳道","空手道","瑜珈","滑冰旱冰","游泳","乒乓球","羽毛球","网球"];
	createCheckbox("c10", c10);
	
	var a1 = ["团岛","火车站（栈桥）","中山路","海大鱼山校区（大学路）","汇泉广场","八大关","市政府","书城","广电大厦（大福源）","澳柯玛立交桥（百安居）","青岛大学（麦岛）","东部市立医院","湛山"];
	createCheckbox("a1", a1);
	var a2 = ["小港","市立医院（西部）","电子信息城","台东","内蒙古路长途汽车站","错埠岭小区","浮山后","山东路家乐福","敦化路","青岛图书馆"];
	createCheckbox("a2", a2);
	var a3 = ["四方利群","青岛理工大学（抚顺路）","兴隆路","杭州路","瑞昌路","宜昌路","孤山村","东方家园（公交四公司）","水清沟（市肿瘤医院）","青岛科技大学（胜利桥）","海琴广场","北岭","杨家群"];
	createCheckbox("a3", a3);
	var a4 = ["太原路","沧口","振华路立交桥","李沧区政府","李沧广场","李村公园","九水路立交桥","侯家庄","永安路","百通花园","百通馨园"];
	createCheckbox("a4", a4);
	var a5 = ["颐中体育场","辽阳路立交桥","青岛国际啤酒城","青岛科技大学东部校区","石老人","青岛市博物馆","海大崂山校区","中韩","沙子口","北村"];
	createCheckbox("a5", a5);
}
